In [2]:
import pandas as pd

In [ ]:
df_customer = pd.DataFrame({
    "CustomerId":[1,2,3],
    "CustomerName":["Ramesh","Suresh","Kalpesh"]
})

df_oreder = pd.DataFrame({
    "Order_id":[2,1,4],
    "OrderAmt":[400,899,599]
})

# you can pass the data frame in list and pass axis row or column
# row vise
df_concate = pd.concat([df_customer,df_oreder],axis=1)
df_concate

   CustomerId CustomerName  Order_id  OrderAmt
0           1       Ramesh         2       400
1           2       Suresh         1       899
2           3      Kalpesh         4       599

In [15]:
# column vise
df_concate = pd.concat([df_customer,df_oreder],axis=0)
df_concate

   CustomerId CustomerName  Order_id  OrderAmt
0         1.0       Ramesh       NaN       NaN
1         2.0       Suresh       NaN       NaN
2         3.0      Kalpesh       NaN       NaN
0         NaN          NaN       2.0     400.0
1         NaN          NaN       1.0     899.0
2         NaN          NaN       4.0     599.0